import HomeCard from "../../components/HomeCard";
import {Box, Grid, Typography} from "@mui/material";
import Header from "../../components/Header";
import Footer from "../../components/Footer";
import styles from "../../styles/Home.module.css";
import Image from 'next/image'
import Profile from '../../public/images/profile.avif';
const PrincipalLecture = () => {
    return (
        <div className={styles.container}>
            <Header/>
            <Box sx={{display:'flex',justifyContent:"center",textAlign:'center',flexDirection:'column' ,marginTop:'2rem'}}>
                <Image
                    src={Profile}
                    alt="Picture of the author"
                    width={200}
                    height={200}
                    objectFit='contain'
                />
                <Box sx={{padding:'2rem',margin:"0 2rem"}}>
                    <Typography component='h1' gutterBottom style={{fontSize:28}}>আবু হেনা মোরশেদ জামান</Typography>
                    <Typography gutterBottom>সভাপতি, গভর্নিং বডি</Typography>
                    <Typography gutterBottom>বাস্তবায়ন পরিবীক্ষণ ও মূল্যায়ন বিভাগ (আইএমইডি), পরিকল্পনা মন্ত্রণালয়।</Typography>
                    <Typography paragraph gutterBottom component='article'>আবু হেনা মােরশেদ জামান ১৯৬৭ সালের ২৪ আগস্ট চট্টগ্রামের এক সম্ভ্রান্ত মুসলিম পরিবারে জন্মগ্রহন করেন।তিনি চট্টগ্রাম বিশ্ববিদ্যালয়, চট্টগ্রাম, বাংলাদেশ হতে রাজনীতি বিজ্ঞান এ স্নাতক(২য় শ্রেণিতে ১ম স্থান) এবং স্নাতকোত্তর(১ম শ্রেণিতে ১ম স্থান) ডিগ্রী অর্জন করেন।ইতােপূর্বে তিনি এসএসসি ও এইচএসসিতে মেধা তালিকায় যথাক্রমে ৫ম ও ৪র্থ স্থান। দখল করেন।বিসিএস(প্রশাসন) ১১তম ব্যাচে তিনি ১ম স্থান অধিকার করেন।বিগত ১২ বছর ধরে তিনি ইউনিসেফ স্পন্সরড বিটিভিতে প্রচারিত স্বাস্থ্য সংক্রান্ত স্কুল বিতর্ক প্রতিযােগিতায় সক্রিয়ভাবে নিয়ােজিত আছেন।ব্যক্তিগত জীবনে তিনি বিবাহিত ও দুই সন্তানের জনক।তাঁর স্ত্রী পেশায় একজন চিকিৎসক এবং একটি বেসরকারি মেডিকেল কলেজের সহকারী অধ্যাপক।

                        সুদীর্ঘ কর্মকালে তিনি দেশের বিভিন্ন স্থানে ও দেশের বাইরে প্রশাসনের বিভিন্ন পদে কর্মরত ছিলেন।সরকারের বিভিন্ন মন্ত্রনালয়সহ মাঠ প্রশাসন পর্যায়ে তিনি দক্ষতা ও নিষ্ঠার সাথে কাজ করছেন।এক্ষেত্রে ঢাকা জেলার অতিরিক্ত জেলা প্রশাসক তাঁর দায়িত্ব পালন উল্লেখযােগ্য।এখানে আরও উল্লেখ্য যে, তিনি প্রধানমন্ত্রী কার্যালয়ের তৎকালীন সচিবের ব্যক্তিগত সচিব হিসেবে দায়িত্ব পালন করেন এবং পরবর্তীতে প্রধানমন্ত্রী কার্যালয়ের পরিচালক(প্রশাসন) হিসেবেও দায়িত্ব পালন করেন।

                        ২০১২ সালে তিনি ইউনেস্কো এর নির্বাহী বোর্ড এর ১৯০তম সভায় যোগদান করেন। পেশাগত উন্নয়নের লক্ষ্যে এ পর্যন্ত তিনি বেশ কিছু সংখ্যক বৈদেশিক প্রশিক্ষণ গ্রহণ করেন। এর মধ্যে মার্কিন যুক্তরাষ্ট্রের ডিউক ইউনিভার্সিটি; মোনাস ইউনিভার্সিটি, মেলবোর্ন, অস্ট্রেলিয়া; এস টি ওয়াই ইন্টারন্যাশনাল, মন্ট্রিল, কানাডা; এশিয়ান ইনস্টিটিউট অফ টেকনোলজি (এ আই টি) থাইল্যান্ড; কোরিয়ান ইন্টারন্যাশনাল অপারেশন এজেন্সি (কোইকা), সিউল দক্ষিণ কোরিয়া; শ্রীরাম ইনস্টিটিউট অব বিজনেস অ্যান্ড ইনফরমেশন টেকনোলজি (এসআইবিআইটি), নয়া দিল্লী ,ভারত উল্লেখযোগ্য। ইউনেস্কো ও আইসেস্কো সংক্রান্ত বিভিন্ন প্রোগ্রামে তিনি আজারবাইজান, তুরস্ক, ইন্দোনেশিয়া ভ্রমণ করেন। এছাড়াও তিনি প্রাচ্য ও পাশ্চাত্যের বিভিন্ন দেশে উল্লেখযোগ্য সংখ্যক সেমিনার/কর্মশালায় যোগদান করেন।

                        জনাব আবু হেনা মোরশেদ জামান গত ২৮ অক্টোবর ২০২১ থেকে বাস্তবায়ন পরিবীক্ষণ ও মূল্যায়ন বিভাগ (আইএমইডি), পরিকল্পনা মন্ত্রণালয় এর সচিব হিসেবে দায়িত্ব পালন করছেন। এর অব্যবহিত পূর্বে তিনি কেন্দ্রীয় ঔষধাগার এর পরিচালক (অতিরিক্ত সচিব) হিসেবে কর্মরত ছিলেন। বর্তমানে তিনি আইডিয়াল স্কুল এন্ড কলেজ, মতিঝিল, ঢাকা এর গভর্নিং বডির সভাপতি হিসেবে দায়িত্ব পালন করছেন।</Typography></Box>

            </Box>
            <Footer/>
        </div>
    )
}
export default PrincipalLecture;